#!/usr/bin/env python
# -*- coding: utf-8 -*-

import os
import random
from datetime import *
import urllib2
import re
import time
import xlsxwriter
import pymysql

BASE_DIR = os.path.dirname(os.path.dirname(__file__))
DC_PATH = BASE_DIR + "/project_in_svn/districtcode.txt"

def createName():
    firstname = [u'自动']
    secondname = [u'赵',u'钱',u'孙',u'李',u'周',u'吴',u'郑',u'王',u'',u'冯',u'陈',u'楮',u'卫',u'蒋',u'沈',u'韩',u'杨',u'',u'朱',u'秦',u'尤',u'许',u'何',u'吕',u'施',u'张',u'',u'孔',u'曹',u'严',u'华',u'金',u'魏',u'陶',u'姜',u'',u'戚',u'谢',u'邹',u'喻',u'柏',u'水',u'窦',u'章',u'',u'云',u'苏',u'潘',u'葛',u'奚',u'范',u'彭',u'郎',u'',u'鲁',u'韦',u'昌',u'马',u'苗',u'凤',u'花',u'方',u'',u'俞',u'任',u'袁',u'柳',u'酆',u'鲍',u'史',u'唐',u'',u'费',u'廉',u'岑',u'薛',u'雷',u'贺',u'倪',u'汤',u'',u'滕',u'殷',u'罗',u'毕',u'郝',u'邬',u'安',u'常',u'',u'乐',u'于',u'时',u'傅',u'皮',u'卞',u'齐',u'康',u'',u'伍',u'余',u'元',u'卜',u'顾',u'孟',u'平',u'黄',u'',u'和',u'穆',u'萧',u'尹',u'姚',u'邵',u'湛',u'汪',u'',u'祁',u'毛',u'禹',u'狄',u'米',u'贝',u'明',u'臧',u'',u'计',u'伏',u'成',u'戴',u'谈',u'宋',u'茅',u'庞',u'',u'熊',u'纪',u'舒',u'屈',u'项',u'祝',u'董',u'梁',u'',u'杜',u'阮',u'蓝',u'闽',u'席',u'季',u'麻',u'强',u'',u'贾',u'路',u'娄',u'危',u'江',u'童',u'颜',u'郭',u'',u'梅',u'盛',u'林',u'刁',u'锺',u'徐',u'丘',u'骆',u'',u'高',u'夏',u'蔡',u'田',u'樊',u'胡',u'凌',u'霍',u'',u'虞',u'万',u'支',u'柯',u'昝',u'管',u'卢',u'莫',u'',u'经',u'房',u'裘',u'缪',u'干',u'解',u'应',u'宗',u'',u'丁',u'宣',u'贲',u'邓',u'郁',u'单',u'杭',u'洪',u'',u'包',u'诸',u'左',u'石',u'崔',u'吉',u'钮',u'龚',u'',u'程',u'嵇',u'邢',u'滑',u'裴',u'陆',u'荣',u'翁',u'',u'荀',u'羊',u'於',u'惠',u'甄',u'麹',u'家',u'封',u'',u'芮',u'羿',u'储',u'靳',u'汲',u'邴',u'糜',u'松',u'',u'井',u'段',u'富',u'巫',u'乌',u'焦',u'巴',u'弓',u'',u'牧',u'隗',u'山',u'谷',u'车',u'侯',u'宓',u'蓬',u'',u'全',u'郗',u'班',u'仰',u'秋',u'仲',u'伊',u'宫',u'',u'宁',u'仇',u'栾',u'暴',u'甘',u'斜',u'厉',u'戎',u'',u'祖',u'武',u'符',u'刘',u'景',u'詹',u'束',u'龙',u'',u'叶',u'幸',u'司',u'韶',u'郜',u'黎',u'蓟',u'薄',u'',u'印',u'宿',u'白',u'怀',u'蒲',u'邰',u'从',u'鄂',u'',u'索',u'咸',u'籍',u'赖',u'卓',u'蔺',u'屠',u'蒙',u'',u'池',u'乔',u'阴',u'郁',u'胥',u'能',u'苍',u'双',u'',u'闻',u'莘',u'党',u'翟',u'谭',u'贡',u'劳',u'逄',u'',u'姬',u'申',u'扶',u'堵',u'冉',u'宰',u'郦',u'雍',u'',u'郤',u'璩',u'桑',u'桂',u'濮',u'牛',u'寿',u'通',u'',u'边',u'扈',u'燕',u'冀',u'郏',u'浦',u'尚',u'农',u'',u'温',u'别',u'庄',u'晏',u'柴',u'瞿',u'阎',u'充',u'',u'慕',u'连',u'茹',u'习',u'宦',u'艾',u'鱼',u'容',u'',u'向',u'古',u'易',u'慎',u'戈',u'廖',u'庾',u'终',u'',u'暨',u'居',u'衡',u'步',u'都',u'耿',u'满',u'弘',u'',u'匡',u'国',u'文',u'寇',u'广',u'禄',u'阙',u'东',u'',u'欧',u'殳',u'沃',u'利',u'蔚',u'越',u'夔',u'隆',u'',u'师',u'巩',u'厍',u'聂',u'晁',u'勾',u'敖',u'融',u'',u'冷',u'訾',u'辛',u'阚',u'那',u'简',u'饶',u'空',u'',u'曾',u'毋',u'沙',u'乜',u'养',u'鞠',u'须',u'丰',u'',u'巢',u'关',u'蒯',u'相',u'查',u'后',u'荆',u'红',u'',u'游',u'竺',u'权',u'逑',u'盖',u'益',u'桓',u'公',u'',u'万俟',u'司马',u'上官',u'欧阳',u'',u'夏侯',u'诸葛',u'闻人',u'东方',u'',u'赫连',u'皇甫',u'尉迟',u'公羊',u'',u'澹台',u'公冶',u'宗政',u'濮阳',u'',u'淳于',u'单于',u'太叔',u'申屠',u'',u'公孙',u'仲孙',u'轩辕',u'令狐',u'',u'锺离',u'宇文',u'长孙',u'慕容',u'',u'鲜于',u'闾丘',u'司徒',u'司空',u'',u'丌官',u'司寇',u'仉',u'督',u'子车',u'',u'颛孙',u'端木',u'巫马',u'公西',u'',u'漆雕',u'乐正',u'壤驷',u'公良',u'',u'拓拔',u'夹谷',u'宰父',u'谷梁',u'',u'晋',u'楚',u'阎',u'法',u'汝',u'鄢',u'涂',u'钦',u'',u'段干',u'百里',u'东郭',u'南门',u'',u'呼延',u'归',u'海',u'羊舌',u'微生',u'',u'岳',u'帅',u'缑',u'亢',u'况',u'后',u'有',u'琴',u'',u'梁丘',u'左丘',u'东门',u'西门',u'',u'商',u'牟',u'佘',u'佴',u'伯',u'赏',u'南宫',u'',u'墨',u'哈',u'谯',u'笪',u'年',u'爱',u'阳',u'佟',u'魁',u'罡',u'机',u'闲',u'勇',u'雄',u'猛',u'威',u'英',u'贵',u'富',u'满',u'孤',u'伤',u'立',u'捷',u'暗',u'佑',u'空',u'速',u'异',u'杀',u'微',u'究',u'退',u'寿',u'剑',u' 平',u'罪',u'损',u'败',u'牢',u'慧',u'暴',u'哭',u'巧']
    thiredname = [u'魁',u'煞',u'勇',u'杰',u'雄',u'威',u'英',u'奇',u'猛',u'文',u'正',u'辟',u'阖',u'强',u'暗',u'轴',u'会',u'佐',u'佑',u'灵',u'兽',u'微',u'慧',u'暴',u'然',u'猖',u'狂',u'飞',u'走',u'巧',u'明',u'进',u'退',u'满',u'遂',u'周',u'隐',u'异',u'理',u'俊',u'乐',u'捷',u'速',u'镇',u'稽',u'魔',u'妖',u'幽',u'伏',u'僻',u'空',u'孤',u'全',u'短',u'角',u'囚',u'藏',u'平',u'损',u'奴',u'察',u'恶',u'丑',u'数',u'阴',u'刑',u'壮',u'劣',u'健',u'耗',u'贼',u'狗']
    name=firstname[random.randrange(0,firstname.__len__())]+secondname[random.randrange(0,secondname.__len__())]+thiredname[random.randrange(0,thiredname.__len__())]+str(random.randint(1,99999))
    return name

def createPhone():
    #prelist = ["130", "131", "132", "133", "134", "135", "136", "137", "138", "139", "147", "150", "151", "152", "153",
    #           "155", "156", "157", "158", "159", "186", "187", "188"]
    phonelist=[]
    Phone=str(time.time()).split('.', 2)[0]+str(random.randint(0,9))
    phonelist.append(Phone)
    prelist = ["10410", "10411", "10412", "10413", "10414", "10415", "10416", "10417", "10418", "10419"]
    Phone1= random.choice(prelist) + "".join(random.choice("0123456789") for i in range(6))
    phonelist.append(Phone1)
    return phonelist[random.randint(0,phonelist.__len__()-1)]

def createQQNumber():
    prelist = ["111", "222", "333", "444", "555", "666", "777", "888", "999"]
    return random.choice(prelist) + "".join(random.choice("0123456789") for i in range(8))

def createSalary():
    salary=random.randint(15000,90000)
    return salary


def createCity():
    city_list=[u'北京市',u'市辖区',u'东城区',u'西城区',u'朝阳区',u'丰台区',u'石景山区',u'海淀区',u'门头沟区',u'房山区',u'通州区',u'顺义区',u'昌平区',u'大兴区',u'怀柔区',u'平谷区',u'密云延庆天津市',u'市辖区',u'和平区',u'河东区',u'河西区',u'南开区',u'河北区',u'红桥区',u'东丽区',u'西青区',u'津南区',u'北辰区',u'武清区',u'宝坻区',u'滨海新区',u'宁河静海蓟河北省',u'石家庄市',u'市辖区',u'长安区',u'桥东区',u'桥西区',u'新华区',u'井陉矿区',u'裕华区',u'井陉正定栾城行唐灵寿高邑深泽赞皇无极平山元氏赵辛集市',u'藁城市',u'晋州市',u'新乐市',u'鹿泉市',u'唐山市',u'市辖区',u'路南区',u'路北区',u'古冶区',u'开平区',u'丰南区',u'丰润区',u'曹妃甸区',u'滦滦南乐亭迁西玉田遵化市',u'迁安市',u'秦皇岛市',u'市辖区',u'海港区',u'山海关区',u'北戴河区',u'青龙满族自治昌黎抚宁卢龙邯郸市',u'市辖区',u'邯山区',u'丛台区',u'复兴区',u'峰峰矿区',u'邯郸临漳成安大名涉磁肥乡永年邱鸡泽广平馆陶魏曲周武安市',u'邢台市',u'市辖区',u'桥东区',u'桥西区',u'邢台临城内丘柏乡隆尧任南和宁晋巨鹿新河广宗平乡威清河临西南宫市',u'沙河市',u'保定市',u'市辖区',u'新市区',u'北市区',u'南市区',u'满城清苑涞水阜平徐水定兴唐高阳容城涞源望都安新易曲阳蠡顺平博野雄涿州市',u'定州市',u'安国市',u'高碑店市',u'张家口市',u'市辖区',u'桥东区',u'桥西区',u'宣化区',u'下花园区',u'宣化张北康保沽源尚义蔚阳原怀安万全怀来涿鹿赤城崇礼承德市',u'市辖区',u'双桥区',u'双滦区',u'鹰手营子矿区',u'承德兴隆平泉滦平隆化丰宁满族自治宽城满族自治围场满族蒙古族自治沧州市',u'市辖区',u'新华区',u'运河区',u'沧青东光海兴盐山肃宁南皮吴桥献孟村回族自治泊头市',u'任丘市',u'黄骅市',u'河间市',u'廊坊市',u'市辖区',u'安次区',u'广阳区',u'固安永清香河大城文安大厂回族自治霸州市',u'三河市',u'衡水市',u'市辖区',u'桃城区',u'枣强武邑武强饶阳安平故城景阜城冀州市',u'深州市',u'山西省',u'太原市',u'市辖区',u'小店区',u'迎泽区',u'杏花岭区',u'尖草坪区',u'万柏林区',u'晋源区',u'清徐阳曲娄烦古交市',u'大同市',u'市辖区',u'城区',u'矿区',u'南郊区',u'新荣区',u'阳高天镇广灵灵丘浑源左云大同阳泉市',u'市辖区',u'城区',u'矿区',u'郊区',u'平定盂长治市',u'市辖区',u'城区',u'郊区',u'长治襄垣屯留平顺黎城壶关长子武乡沁沁源潞城市',u'晋城市',u'市辖区',u'城区',u'沁水阳城陵川泽州高平市',u'朔州市',u'市辖区',u'朔城区',u'平鲁区',u'山阴应右玉怀仁晋中市',u'市辖区',u'榆次区',u'榆社左权和顺昔阳寿阳太谷祁平遥灵石介休市',u'运城市',u'市辖区',u'盐湖区',u'临猗万荣闻喜稷山新绛绛垣曲夏平陆芮城永济市',u'河津市',u'忻州市',u'市辖区',u'忻府区',u'定襄五台代繁峙宁武静乐神池五寨岢岚河曲保德偏关原平市',u'临汾市',u'市辖区',u'尧都区',u'曲沃翼城襄汾洪洞古安泽浮山吉乡宁大宁隰永和蒲汾西侯马市',u'霍州市',u'吕梁市',u'市辖区',u'离石区',u'文水交城兴临柳林石楼岚方山中阳交口孝义市',u'汾阳市',u'内蒙古自治区',u'呼和浩特市',u'市辖区',u'新城区',u'回民区',u'玉泉区',u'赛罕区',u'土默特左旗',u'托克托和林格尔清水河武川包头市',u'市辖区',u'东河区',u'昆都仑区',u'青山区',u'石拐区',u'白云鄂博矿区',u'九原区',u'土默特右旗',u'固阳达尔罕茂明安联合旗',u'乌海市',u'市辖区',u'海勃湾区',u'海南区',u'乌达区',u'赤峰市',u'市辖区',u'红山区',u'元宝山区',u'松山区',u'阿鲁科尔沁旗',u'巴林左旗',u'巴林右旗',u'林西克什克腾旗',u'翁牛特旗',u'喀喇沁旗',u'宁城敖汉旗',u'通辽市',u'市辖区',u'科尔沁区',u'科尔沁左翼中旗',u'科尔沁左翼后旗',u'开鲁库伦旗',u'奈曼旗',u'扎鲁特旗',u'霍林郭勒市',u'鄂尔多斯市',u'市辖区',u'东胜区',u'达拉特旗',u'准格尔旗',u'鄂托克前旗',u'鄂托克旗',u'杭锦旗',u'乌审旗',u'伊金霍洛旗',u'呼伦贝尔市',u'市辖区',u'海拉尔区',u'扎赉诺尔区',u'阿荣旗',u'莫力达瓦达斡尔族自治旗',u'鄂伦春自治旗',u'鄂温克族自治旗',u'陈巴尔虎旗',u'新巴尔虎左旗',u'新巴尔虎右旗',u'满洲里市',u'牙克石市',u'扎兰屯市',u'额尔古纳市',u'根河市',u'巴彦淖尔市',u'市辖区',u'临河区',u'五原磴口乌拉特前旗',u'乌拉特中旗',u'乌拉特后旗',u'杭锦后旗',u'乌兰察布市',u'市辖区',u'集宁区',u'卓资化德商都兴和凉城察哈尔右翼前旗',u'察哈尔右翼中旗',u'察哈尔右翼后旗',u'四子王旗',u'丰镇市',u'兴安盟',u'乌兰浩特市',u'阿尔山市',u'科尔沁右翼前旗',u'科尔沁右翼中旗',u'扎赉特旗',u'突泉锡林郭勒盟',u'二连浩特市',u'锡林浩特市',u'阿巴嘎旗',u'苏尼特左旗',u'苏尼特右旗',u'东乌珠穆沁旗',u'西乌珠穆沁旗',u'太仆寺旗',u'镶黄旗',u'正镶白旗',u'正蓝旗',u'多伦阿拉善盟',u'阿拉善左旗',u'阿拉善右旗',u'额济纳旗',u'辽宁省',u'沈阳市',u'市辖区',u'和平区',u'沈河区',u'大东区',u'皇姑区',u'铁西区',u'苏家屯区',u'东陵区',u'沈北新区',u'于洪区',u'辽中康平法库新民市',u'大连市',u'市辖区',u'中山区',u'西岗区',u'沙河口区',u'甘井子区',u'旅顺口区',u'金州区',u'长海瓦房店市',u'普兰店市',u'庄河市',u'鞍山市',u'市辖区',u'铁东区',u'铁西区',u'立山区',u'千山区',u'台安岫岩满族自治海城市',u'抚顺市',u'市辖区',u'新抚区',u'东洲区',u'望花区',u'顺城区',u'抚顺新宾满族自治清原满族自治本溪市',u'市辖区',u'平山区',u'溪湖区',u'明山区',u'南芬区',u'本溪满族自治桓仁满族自治丹东市',u'市辖区',u'元宝区',u'振兴区',u'振安区',u'宽甸满族自治东港市',u'凤城市',u'锦州市',u'市辖区',u'古塔区',u'凌河区',u'太和区',u'黑山义凌海市',u'北镇市',u'营口市',u'市辖区',u'站前区',u'西市区',u'鲅鱼圈区',u'老边区',u'盖州市',u'大石桥市',u'阜新市',u'市辖区',u'海州区',u'新邱区',u'太平区',u'清河门区',u'细河区',u'阜新蒙古族自治彰武辽阳市',u'市辖区',u'白塔区',u'文圣区',u'宏伟区',u'弓长岭区',u'太子河区',u'辽阳灯塔市',u'盘锦市',u'市辖区',u'双台子区',u'兴隆台区',u'大洼盘山铁岭市',u'市辖区',u'银州区',u'清河区',u'铁岭西丰昌图调兵山市',u'开原市',u'朝阳市',u'市辖区',u'双塔区',u'龙城区',u'朝阳建平喀喇沁左翼蒙古族自治北票市',u'凌源市',u'葫芦岛市',u'市辖区',u'连山区',u'龙港区',u'南票区',u'绥中建昌兴城市',u'吉林省',u'长春市',u'市辖区',u'南关区',u'宽城区',u'朝阳区',u'二道区',u'绿园区',u'双阳区',u'农安九台市',u'榆树市',u'德惠市',u'吉林市',u'市辖区',u'昌邑区',u'龙潭区',u'船营区',u'丰满区',u'永吉蛟河市',u'桦甸市',u'舒兰市',u'磐石市',u'四平市',u'市辖区',u'铁西区',u'铁东区',u'梨树伊通满族自治公主岭市',u'双辽市',u'辽源市',u'市辖区',u'龙山区',u'西安区',u'东丰东辽通化市',u'市辖区',u'东昌区',u'二道江区',u'通化辉南柳河梅河口市',u'集安市',u'白山市',u'市辖区',u'浑江区',u'江源区',u'抚松靖宇长白朝鲜族自治临江市',u'松原市',u'市辖区',u'宁江区',u'前郭尔罗斯蒙古族自治长岭乾安扶余市',u'白城市',u'市辖区',u'洮北区',u'镇赉通榆洮南市',u'大安市',u'延边朝鲜族自治州',u'延吉市',u'图们市',u'敦化市',u'珲春市',u'龙井市',u'和龙市',u'汪清安图黑龙江省',u'哈尔滨市',u'市辖区',u'道里区',u'南岗区',u'道外区',u'平房区',u'松北区',u'香坊区',u'呼兰区',u'阿城区',u'依兰方正宾巴彦木兰通河延寿双城市',u'尚志市',u'五常市',u'齐齐哈尔市',u'市辖区',u'龙沙区',u'建华区',u'铁锋区',u'昂昂溪区',u'富拉尔基区',u'碾子山区',u'梅里斯达斡尔族区',u'龙江依安泰来甘南富裕克山克东拜泉讷河市',u'鸡西市',u'市辖区',u'鸡冠区',u'恒山区',u'滴道区',u'梨树区',u'城子河区',u'麻山区',u'鸡东虎林市',u'密山市',u'鹤岗市',u'市辖区',u'向阳区',u'工农区',u'南山区',u'兴安区',u'东山区',u'兴山区',u'萝北绥滨双鸭山市',u'市辖区',u'尖山区',u'岭东区',u'四方台区',u'宝山区',u'集贤友谊宝清饶河大庆市',u'市辖区',u'萨尔图区',u'龙凤区',u'让胡路区',u'红岗区',u'大同区',u'肇州肇源林甸杜尔伯特蒙古族自治伊春市',u'市辖区',u'伊春区',u'南岔区',u'友好区',u'西林区',u'翠峦区',u'新青区',u'美溪区',u'金山屯区',u'五营区',u'乌马河区',u'汤旺河区',u'带岭区',u'乌伊岭区',u'红星区',u'上甘岭区',u'嘉荫铁力市',u'佳木斯市',u'市辖区',u'向阳区',u'前进区',u'东风区',u'郊区',u'桦南桦川汤原抚远同江市',u'富锦市',u'七台河市',u'市辖区',u'新兴区',u'桃山区',u'茄子河区',u'勃利牡丹江市',u'市辖区',u'东安区',u'阳明区',u'爱民区',u'西安区',u'东宁林口绥芬河市',u'海林市',u'宁安市',u'穆棱市',u'黑河市',u'市辖区',u'爱辉区',u'嫩江逊克孙吴北安市',u'五大连池市',u'绥化市',u'市辖区',u'北林区',u'望奎兰西青冈庆安明水绥棱安达市',u'肇东市',u'海伦市',u'大兴安岭地区',u'呼玛塔河漠河上海市',u'市辖区',u'黄浦区',u'徐汇区',u'长宁区',u'静安区',u'普陀区',u'闸北区',u'虹口区',u'杨浦区',u'闵行区',u'宝山区',u'嘉定区',u'浦东新区',u'金山区',u'松江区',u'青浦区',u'奉贤区',u'崇明江苏省',u'南京市',u'市辖区',u'玄武区',u'秦淮区',u'建邺区',u'鼓楼区',u'浦口区',u'栖霞区',u'雨花台区',u'江宁区',u'六合区',u'溧水区',u'高淳区',u'无锡市',u'市辖区',u'崇安区',u'南长区',u'北塘区',u'锡山区',u'惠山区',u'滨湖区',u'江阴市',u'宜兴市',u'徐州市',u'市辖区',u'鼓楼区',u'云龙区',u'贾汪区',u'泉山区',u'铜山区',u'丰沛睢宁新沂市',u'邳州市',u'常州市',u'市辖区',u'天宁区',u'钟楼区',u'戚墅堰区',u'新北区',u'武进区',u'溧阳市',u'金坛市',u'苏州市',u'市辖区',u'虎丘区',u'吴中区',u'相城区',u'姑苏区',u'吴江区',u'常熟市',u'张家港市',u'昆山市',u'太仓市',u'南通市',u'市辖区',u'崇川区',u'港闸区',u'通州区',u'海安如东启东市',u'如皋市',u'海门市',u'连云港市',u'市辖区',u'连云区',u'新浦区',u'海州区',u'赣榆东海灌云灌南淮安市',u'市辖区',u'清河区',u'淮安区',u'淮阴区',u'清浦区',u'涟水洪泽盱眙金湖盐城市',u'市辖区',u'亭湖区',u'盐都区',u'响水滨海阜宁射阳建湖东台市',u'大丰市',u'扬州市',u'市辖区',u'广陵区',u'邗江区',u'江都区',u'宝应仪征市',u'高邮市',u'镇江市',u'市辖区',u'京口区',u'润州区',u'丹徒区',u'丹阳市',u'扬中市',u'句容市',u'泰州市',u'市辖区',u'海陵区',u'高港区',u'姜堰区',u'兴化市',u'靖江市',u'泰兴市',u'宿迁市',u'市辖区',u'宿城区',u'宿豫区',u'沭阳泗阳泗洪浙江省',u'杭州市',u'市辖区',u'上城区',u'下城区',u'江干区',u'拱墅区',u'西湖区',u'滨江区',u'萧山区',u'余杭区',u'桐庐淳安建德市',u'富阳市',u'临安市',u'宁波市',u'市辖区',u'海曙区',u'江东区',u'江北区',u'北仑区',u'镇海区',u'鄞州区',u'象山宁海余姚市',u'慈溪市',u'奉化市',u'温州市',u'市辖区',u'鹿城区',u'龙湾区',u'瓯海区',u'洞头永嘉平阳苍南文成泰顺瑞安市',u'乐清市',u'嘉兴市',u'市辖区',u'南湖区',u'秀洲区',u'嘉善海盐海宁市',u'平湖市',u'桐乡市',u'湖州市',u'市辖区',u'吴兴区',u'南浔区',u'德清长兴安吉绍兴市',u'市辖区',u'越城区',u'绍兴新昌诸暨市',u'上虞市',u'嵊州市',u'金华市',u'市辖区',u'婺城区',u'金东区',u'武义浦江磐安兰溪市',u'义乌市',u'东阳市',u'永康市',u'衢州市',u'市辖区',u'柯城区',u'衢江区',u'常山开化龙游江山市',u'舟山市',u'市辖区',u'定海区',u'普陀区',u'岱山嵊泗台州市',u'市辖区',u'椒江区',u'黄岩区',u'路桥区',u'玉环三门天台仙居温岭市',u'临海市',u'丽水市',u'市辖区',u'莲都区',u'青田缙云遂昌松阳云和庆元景宁畲族自治龙泉市',u'安徽省',u'合肥市',u'市辖区',u'瑶海区',u'庐阳区',u'蜀山区',u'包河区',u'长丰肥东肥西庐江巢湖市',u'芜湖市',u'市辖区',u'镜湖区',u'弋江区',u'鸠江区',u'三山区',u'芜湖繁昌南陵无为蚌埠市',u'市辖区',u'龙子湖区',u'蚌山区',u'禹会区',u'淮上区',u'怀远五河固镇淮南市',u'市辖区',u'大通区',u'田家庵区',u'谢家集区',u'八公山区',u'潘集区',u'凤台马鞍山市',u'市辖区',u'花山区',u'雨山区',u'博望区',u'当涂含山和淮北市',u'市辖区',u'杜集区',u'相山区',u'烈山区',u'濉溪铜陵市',u'市辖区',u'铜官山区',u'狮子山区',u'郊区',u'铜陵安庆市',u'市辖区',u'迎江区',u'大观区',u'宜秀区',u'怀宁枞阳潜山太湖宿松望江岳西桐城市',u'黄山市',u'市辖区',u'屯溪区',u'黄山区',u'徽州区',u'歙休宁黟祁门滁州市',u'市辖区',u'琅琊区',u'南谯区',u'来安全椒定远凤阳天长市',u'明光市',u'阜阳市',u'市辖区',u'颍州区',u'颍东区',u'颍泉区',u'临泉太和阜南颍上界首市',u'宿州市',u'市辖区',u'埇桥区',u'砀山萧灵璧泗六安市',u'市辖区',u'金安区',u'裕安区',u'寿霍邱舒城金寨霍山亳州市',u'市辖区',u'谯城区',u'涡阳蒙城利辛池州市',u'市辖区',u'贵池区',u'东至石台青阳宣城市',u'市辖区',u'宣州区',u'郎溪广德泾绩溪旌德宁国市',u'福建省',u'福州市',u'市辖区',u'鼓楼区',u'台江区',u'仓山区',u'马尾区',u'晋安区',u'闽侯连江罗源闽清永泰平潭福清市',u'长乐市',u'厦门市',u'市辖区',u'思明区',u'海沧区',u'湖里区',u'集美区',u'同安区',u'翔安区',u'莆田市',u'市辖区',u'城厢区',u'涵江区',u'荔城区',u'秀屿区',u'仙游三明市',u'市辖区',u'梅列区',u'三元区',u'明溪清流宁化大田尤溪沙将乐泰宁建宁永安市',u'泉州市',u'市辖区',u'鲤城区',u'丰泽区',u'洛江区',u'泉港区',u'惠安安溪永春德化金门石狮市',u'晋江市',u'南安市',u'漳州市',u'市辖区',u'芗城区',u'龙文区',u'云霄漳浦诏安长泰东山南靖平和华安龙海市',u'南平市',u'市辖区',u'延平区',u'顺昌浦城光泽松溪政和邵武市',u'武夷山市',u'建瓯市',u'建阳市',u'龙岩市',u'市辖区',u'新罗区',u'长汀永定上杭武平连城漳平市',u'宁德市',u'市辖区',u'蕉城区',u'霞浦古田屏南寿宁周宁柘荣福安市',u'福鼎市',u'江西省',u'南昌市',u'市辖区',u'东湖区',u'西湖区',u'青云谱区',u'湾里区',u'青山湖区',u'南昌新建安义进贤景德镇市',u'市辖区',u'昌江区',u'珠山区',u'浮梁乐平市',u'萍乡市',u'市辖区',u'安源区',u'湘东区',u'莲花上栗芦溪九江市',u'市辖区',u'庐山区',u'浔阳区',u'九江武宁修水永修德安星子都昌湖口彭泽瑞昌市',u'共青城市',u'新余市',u'市辖区',u'渝水区',u'分宜鹰潭市',u'市辖区',u'月湖区',u'余江贵溪市',u'赣州市',u'市辖区',u'章贡区',u'赣信丰大余上犹崇义安远龙南定南全南宁都于都兴国会昌寻乌石城瑞金市',u'南康市',u'吉安市',u'市辖区',u'吉州区',u'青原区',u'吉安吉水峡江新干永丰泰和遂川万安安福永新井冈山市',u'宜春市',u'市辖区',u'袁州区',u'奉新万载上高宜丰靖安铜鼓丰城市',u'樟树市',u'高安市',u'抚州市',u'市辖区',u'临川区',u'南城黎川南丰崇仁乐安宜黄金溪资溪东乡广昌上饶市',u'市辖区',u'信州区',u'上饶广丰玉山铅山横峰弋阳余干鄱阳万年婺源德兴市',u'山东省',u'济南市',u'市辖区',u'历下区',u'市中区',u'槐荫区',u'天桥区',u'历城区',u'长清区',u'平阴济阳商河章丘市',u'青岛市',u'市辖区',u'市南区',u'市北区',u'黄岛区',u'崂山区',u'李沧区',u'城阳区',u'胶州市',u'即墨市',u'平度市',u'莱西市',u'淄博市',u'市辖区',u'淄川区',u'张店区',u'博山区',u'临淄区',u'周村区',u'桓台高青沂源枣庄市',u'市辖区',u'市中区',u'薛城区',u'峄城区',u'台儿庄区',u'山亭区',u'滕州市',u'东营市',u'市辖区',u'东营区',u'河口区',u'垦利利津广饶烟台市',u'市辖区',u'芝罘区',u'福山区',u'牟平区',u'莱山区',u'长岛龙口市',u'莱阳市',u'莱州市',u'蓬莱市',u'招远市',u'栖霞市',u'海阳市',u'潍坊市',u'市辖区',u'潍城区',u'寒亭区',u'坊子区',u'奎文区',u'临朐昌乐青州市',u'诸城市',u'寿光市',u'安丘市',u'高密市',u'昌邑市',u'济宁市',u'市辖区',u'市中区',u'任城区',u'微山鱼台金乡嘉祥汶上泗水梁山曲阜市',u'兖州市',u'邹城市',u'泰安市',u'市辖区',u'泰山区',u'岱岳区',u'宁阳东平新泰市',u'肥城市',u'威海市',u'市辖区',u'环翠区',u'文登市',u'荣成市',u'乳山市',u'日照市',u'市辖区',u'东港区',u'岚山区',u'五莲莒莱芜市',u'市辖区',u'莱城区',u'钢城区',u'临沂市',u'市辖区',u'兰山区',u'罗庄区',u'河东区',u'沂南郯城沂水苍山费平邑莒南蒙阴临沭德州市',u'市辖区',u'德城区',u'陵宁津庆云临邑齐河平原夏津武城乐陵市',u'禹城市',u'聊城市',u'市辖区',u'东昌府区',u'阳谷莘茌平东阿冠高唐临清市',u'滨州市',u'市辖区',u'滨城区',u'惠民阳信无棣沾化博兴邹平菏泽市',u'市辖区',u'牡丹区',u'曹单成武巨野郓城鄄城定陶东明河南省',u'郑州市',u'市辖区',u'中原区',u'二七区',u'管城回族区',u'金水区',u'上街区',u'惠济区',u'中牟巩义市',u'荥阳市',u'新密市',u'新郑市',u'登封市',u'开封市',u'市辖区',u'龙亭区',u'顺河回族区',u'鼓楼区',u'禹王台区',u'金明区',u'杞通许尉氏开封兰考洛阳市',u'市辖区',u'老城区',u'西工区',u'瀍河回族区',u'涧西区',u'吉利区',u'洛龙区',u'孟津新安栾川嵩汝阳宜阳洛宁伊川偃师市',u'平顶山市',u'市辖区',u'新华区',u'卫东区',u'石龙区',u'湛河区',u'宝丰叶鲁山郏舞钢市',u'汝州市',u'安阳市',u'市辖区',u'文峰区',u'北关区',u'殷都区',u'龙安区',u'安阳汤阴滑内黄林州市',u'鹤壁市',u'市辖区',u'鹤山区',u'山城区',u'淇滨区',u'浚淇新乡市',u'市辖区',u'红旗区',u'卫滨区',u'凤泉区',u'牧野区',u'新乡获嘉原阳延津封丘长垣卫辉市',u'辉县市',u'焦作市',u'市辖区',u'解放区',u'中站区',u'马村区',u'山阳区',u'修武博爱武陟温沁阳市',u'孟州市',u'濮阳市',u'市辖区',u'华龙区',u'清丰南乐范台前濮阳许昌市',u'市辖区',u'魏都区',u'许昌鄢陵襄城禹州市',u'长葛市',u'漯河市',u'市辖区',u'源汇区',u'郾城区',u'召陵区',u'舞阳临颍三门峡市',u'市辖区',u'湖滨区',u'渑池陕卢氏义马市',u'灵宝市',u'南阳市',u'市辖区',u'宛城区',u'卧龙区',u'南召方城西峡镇平内乡淅川社旗唐河新野桐柏邓州市',u'商丘市',u'市辖区',u'梁园区',u'睢阳区',u'民权睢宁陵柘城虞城夏邑永城市',u'信阳市',u'市辖区',u'浉河区',u'平桥区',u'罗山光山新商城固始潢川淮滨息周口市',u'市辖区',u'川汇区',u'扶沟西华商水沈丘郸城淮阳太康鹿邑项城市',u'驻马店市',u'市辖区',u'驿城区',u'西平上蔡平舆正阳确山泌阳汝南遂平新蔡省直辖县级行政区划',u'济源市',u'湖北省',u'武汉市',u'市辖区',u'江岸区',u'江汉区',u'硚口区',u'汉阳区',u'武昌区',u'青山区',u'洪山区',u'东西湖区',u'汉南区',u'蔡甸区',u'江夏区',u'黄陂区',u'新洲区',u'黄石市',u'市辖区',u'黄石港区',u'西塞山区',u'下陆区',u'铁山区',u'阳新大冶市',u'十堰市',u'市辖区',u'茅箭区',u'张湾区',u'郧郧西竹山竹溪房丹江口市',u'宜昌市',u'市辖区',u'西陵区',u'伍家岗区',u'点军区',u'猇亭区',u'夷陵区',u'远安兴山秭归长阳土家族自治五峰土家族自治宜都市',u'当阳市',u'枝江市',u'襄阳市',u'市辖区',u'襄城区',u'樊城区',u'襄州区',u'南漳谷城保康老河口市',u'枣阳市',u'宜城市',u'鄂州市',u'市辖区',u'梁子湖区',u'华容区',u'鄂城区',u'荆门市',u'市辖区',u'东宝区',u'掇刀区',u'京山沙洋钟祥市',u'孝感市',u'市辖区',u'孝南区',u'孝昌大悟云梦应城市',u'安陆市',u'汉川市',u'荆州市',u'市辖区',u'沙市区',u'荆州区',u'公安监利江陵石首市',u'洪湖市',u'松滋市',u'黄冈市',u'市辖区',u'黄州区',u'团风红安罗田英山浠水蕲春黄梅麻城市',u'武穴市',u'咸宁市',u'市辖区',u'咸安区',u'嘉鱼通城崇阳通山赤壁市',u'随州市',u'市辖区',u'曾都区',u'随广水市',u'恩施土家族苗族自治州',u'恩施市',u'利川市',u'建始巴东宣恩咸丰来凤鹤峰省直辖县级行政区划',u'仙桃市',u'潜江市',u'天门市',u'神农架林区',u'湖南省',u'长沙市',u'市辖区',u'芙蓉区',u'天心区',u'岳麓区',u'开福区',u'雨花区',u'望城区',u'长沙宁乡浏阳市',u'株洲市',u'市辖区',u'荷塘区',u'芦淞区',u'石峰区',u'天元区',u'株洲攸茶陵炎陵醴陵市',u'湘潭市',u'市辖区',u'雨湖区',u'岳塘区',u'湘潭湘乡市',u'韶山市',u'衡阳市',u'市辖区',u'珠晖区',u'雁峰区',u'石鼓区',u'蒸湘区',u'南岳区',u'衡阳衡南衡山衡东祁东耒阳市',u'常宁市',u'邵阳市',u'市辖区',u'双清区',u'大祥区',u'北塔区',u'邵东新邵邵阳隆回洞口绥宁新宁城步苗族自治武冈市',u'岳阳市',u'市辖区',u'岳阳楼区',u'云溪区',u'君山区',u'岳阳华容湘阴平江汨罗市',u'临湘市',u'常德市',u'市辖区',u'武陵区',u'鼎城区',u'安乡汉寿澧临澧桃源石门津市市',u'张家界市',u'市辖区',u'永定区',u'武陵源区',u'慈利桑植益阳市',u'市辖区',u'资阳区',u'赫山区',u'南桃江安化沅江市',u'郴州市',u'市辖区',u'北湖区',u'苏仙区',u'桂阳宜章永兴嘉禾临武汝城桂东安仁资兴市',u'永州市',u'市辖区',u'零陵区',u'冷水滩区',u'祁阳东安双牌道江永宁远蓝山新田江华瑶族自治怀化市',u'市辖区',u'鹤城区',u'中方沅陵辰溪溆浦会同麻阳苗族自治新晃侗族自治芷江侗族自治靖州苗族侗族自治通道侗族自治洪江市',u'娄底市',u'市辖区',u'娄星区',u'双峰新化冷水江市',u'涟源市',u'湘西土家族苗族自治州',u'吉首市',u'泸溪凤凰花垣保靖古丈永顺龙山广东省',u'广州市',u'市辖区',u'荔湾区',u'越秀区',u'海珠区',u'天河区',u'白云区',u'黄埔区',u'番禺区',u'花都区',u'南沙区',u'萝岗区',u'增城市',u'从化市',u'韶关市',u'市辖区',u'武江区',u'浈江区',u'曲江区',u'始兴仁化翁源乳源瑶族自治新丰乐昌市',u'南雄市',u'深圳市',u'市辖区',u'罗湖区',u'福田区',u'南山区',u'宝安区',u'龙岗区',u'盐田区',u'珠海市',u'市辖区',u'香洲区',u'斗门区',u'金湾区',u'汕头市',u'市辖区',u'龙湖区',u'金平区',u'濠江区',u'潮阳区',u'潮南区',u'澄海区',u'南澳佛山市',u'市辖区',u'禅城区',u'南海区',u'顺德区',u'三水区',u'高明区',u'江门市',u'市辖区',u'蓬江区',u'江海区',u'新会区',u'台山市',u'开平市',u'鹤山市',u'恩平市',u'湛江市',u'市辖区',u'赤坎区',u'霞山区',u'坡头区',u'麻章区',u'遂溪徐闻廉江市',u'雷州市',u'吴川市',u'茂名市',u'市辖区',u'茂南区',u'茂港区',u'电白高州市',u'化州市',u'信宜市',u'肇庆市',u'市辖区',u'端州区',u'鼎湖区',u'广宁怀集封开德庆高要市',u'四会市',u'惠州市',u'市辖区',u'惠城区',u'惠阳区',u'博罗惠东龙门梅州市',u'市辖区',u'梅江区',u'梅大埔丰顺五华平远蕉岭兴宁市',u'汕尾市',u'市辖区',u'城区',u'海丰陆河陆丰市',u'河源市',u'市辖区',u'源城区',u'紫金龙川连平和平东源阳江市',u'市辖区',u'江城区',u'阳西阳东阳春市',u'清远市',u'市辖区',u'清城区',u'清新区',u'佛冈阳山连山壮族瑶族自治连南瑶族自治英德市',u'连州市',u'东莞市',u'中山市',u'潮州市',u'市辖区',u'湘桥区',u'潮安区',u'饶平揭阳市',u'市辖区',u'榕城区',u'揭东区',u'揭西惠来普宁市',u'云浮市',u'市辖区',u'云城区',u'新兴郁南云安罗定市',u'广西壮族自治区',u'南宁市',u'市辖区',u'兴宁区',u'青秀区',u'江南区',u'西乡塘区',u'良庆区',u'邕宁区',u'武鸣隆安马山上林宾阳横柳州市',u'市辖区',u'城中区',u'鱼峰区',u'柳南区',u'柳北区',u'柳江柳城鹿寨融安融水苗族自治三江侗族自治桂林市',u'市辖区',u'秀峰区',u'叠彩区',u'象山区',u'七星区',u'雁山区',u'临桂区',u'阳朔灵川全州兴安永福灌阳龙胜各族自治资源平乐荔浦恭城瑶族自治梧州市',u'市辖区',u'万秀区',u'长洲区',u'龙圩区',u'苍梧藤蒙山岑溪市',u'北海市',u'市辖区',u'海城区',u'银海区',u'铁山港区',u'合浦防城港市',u'市辖区',u'港口区',u'防城区',u'上思东兴市',u'钦州市',u'市辖区',u'钦南区',u'钦北区',u'灵山浦北贵港市',u'市辖区',u'港北区',u'港南区',u'覃塘区',u'平南桂平市',u'玉林市',u'市辖区',u'玉州区',u'福绵区',u'容陆川博白兴业北流市',u'百色市',u'市辖区',u'右江区',u'田阳田东平果德保靖西那坡凌云乐业田林西林隆林各族自治贺州市',u'市辖区',u'八步区',u'昭平钟山富川瑶族自治河池市',u'市辖区',u'金城江区',u'南丹天峨凤山东兰罗城仫佬族自治环江毛南族自治巴马瑶族自治都安瑶族自治大化瑶族自治宜州市',u'来宾市',u'市辖区',u'兴宾区',u'忻城象州武宣金秀瑶族自治合山市',u'崇左市',u'市辖区',u'江州区',u'扶绥宁明龙州大新天等凭祥市',u'海南省',u'海口市',u'市辖区',u'秀英区',u'龙华区',u'琼山区',u'美兰区',u'三亚市',u'市辖区',u'三沙市',u'西沙群岛',u'南沙群岛',u'中沙群岛的岛礁及其海域',u'省直辖县级行政区划',u'五指山市',u'琼海市',u'儋州市',u'文昌市',u'万宁市',u'东方市',u'定安屯昌澄迈临高白沙黎族自治昌江黎族自治乐东黎族自治陵水黎族自治保亭黎族苗族自治琼中黎族苗族自治重庆市',u'市辖区',u'万州区',u'涪陵区',u'渝中区',u'大渡口区',u'江北区',u'沙坪坝区',u'九龙坡区',u'南岸区',u'北碚区',u'綦江区',u'大足区',u'渝北区',u'巴南区',u'黔江区',u'长寿区',u'江津区',u'合川区',u'永川区',u'南川区',u'潼南铜梁荣昌璧山梁平城口丰都垫江武隆忠开云阳奉节巫山巫溪石柱土家族自治秀山土家族苗族自治酉阳土家族苗族自治彭水苗族土家族自治四川省',u'成都市',u'市辖区',u'锦江区',u'青羊区',u'金牛区',u'武侯区',u'成华区',u'龙泉驿区',u'青白江区',u'新都区',u'温江区',u'金堂双流郫大邑蒲江新津都江堰市',u'彭州市',u'邛崃市',u'崇州市',u'自贡市',u'市辖区',u'自流井区',u'贡井区',u'大安区',u'沿滩区',u'荣富顺攀枝花市',u'市辖区',u'东区',u'西区',u'仁和区',u'米易盐边泸州市',u'市辖区',u'江阳区',u'纳溪区',u'龙马潭区',u'泸合江叙永古蔺德阳市',u'市辖区',u'旌阳区',u'中江罗江广汉市',u'什邡市',u'绵竹市',u'绵阳市',u'市辖区',u'涪城区',u'游仙区',u'三台盐亭安梓潼北川羌族自治平武江油市',u'广元市',u'市辖区',u'利州区',u'元坝区',u'朝天区',u'旺苍青川剑阁苍溪遂宁市',u'市辖区',u'船山区',u'安居区',u'蓬溪射洪大英内江市',u'市辖区',u'市中区',u'东兴区',u'威远资中隆昌乐山市',u'市辖区',u'市中区',u'沙湾区',u'五通桥区',u'金口河区',u'犍为井研夹江沐川峨边彝族自治马边彝族自治峨眉山市',u'南充市',u'市辖区',u'顺庆区',u'高坪区',u'嘉陵区',u'南部营山蓬安仪陇西充阆中市',u'眉山市',u'市辖区',u'东坡区',u'仁寿彭山洪雅丹棱青神宜宾市',u'市辖区',u'翠屏区',u'南溪区',u'宜宾江安长宁高珙筠连兴文屏山广安市',u'市辖区',u'广安区',u'前锋区',u'岳池武胜邻水华蓥市',u'达州市',u'市辖区',u'通川区',u'达川区',u'宣汉开江大竹渠万源市',u'雅安市',u'市辖区',u'雨城区',u'名山区',u'荥经汉源石棉天全芦山宝兴巴中市',u'市辖区',u'巴州区',u'恩阳区',u'通江南江平昌资阳市',u'市辖区',u'雁江区',u'安岳乐至简阳市',u'阿坝藏族羌族自治州',u'汶川理茂松潘九寨沟金川小金黑水马尔康壤塘阿坝若尔盖红原甘孜藏族自治州',u'康定泸定丹巴九龙雅江道孚炉霍甘孜新龙德格白玉石渠色达理塘巴塘乡城稻城得荣凉山彝族自治州',u'西昌市',u'木里藏族自治盐源德昌会理会东宁南普格布拖金阳昭觉喜德冕宁越西甘洛美姑雷波贵州省',u'贵阳市',u'市辖区',u'南明区',u'云岩区',u'花溪区',u'乌当区',u'白云区',u'观山湖区',u'开阳息烽修文清镇市',u'六盘水市',u'钟山区',u'六枝特区',u'水城盘遵义市',u'市辖区',u'红花岗区',u'汇川区',u'遵义桐梓绥阳正安道真仡佬族苗族自治务川仡佬族苗族自治凤冈湄潭余庆习水赤水市',u'仁怀市',u'安顺市',u'市辖区',u'西秀区',u'平坝普定镇宁布依族苗族自治关岭布依族苗族自治紫云苗族布依族自治毕节市',u'市辖区',u'七星关区',u'大方黔西金沙织金纳雍威宁彝族回族苗族自治赫章铜仁市',u'市辖区',u'碧江区',u'万山区',u'江口玉屏侗族自治石阡思南印江土家族苗族自治德江沿河土家族自治松桃苗族自治黔西南布依族苗族自治州',u'兴义市',u'兴仁普安晴隆贞丰望谟册亨安龙黔东南苗族侗族自治州',u'凯里市',u'黄平施秉三穗镇远岑巩天柱锦屏剑河台江黎平榕江从江雷山麻江丹寨黔南布依族苗族自治州',u'都匀市',u'福泉市',u'荔波贵定瓮安独山平塘罗甸长顺龙里惠水三都水族自治云南省',u'昆明市',u'市辖区',u'五华区',u'盘龙区',u'官渡区',u'西山区',u'东川区',u'呈贡区',u'晋宁富民宜良石林彝族自治嵩明禄劝彝族苗族自治寻甸回族彝族自治安宁市',u'曲靖市',u'市辖区',u'麒麟区',u'马龙陆良师宗罗平富源会泽沾益宣威市',u'玉溪市',u'市辖区',u'红塔区',u'江川澄江通海华宁易门峨山彝族自治新平彝族傣族自治元江哈尼族彝族傣族自治保山市',u'市辖区',u'隆阳区',u'施甸腾冲龙陵昌宁昭通市',u'市辖区',u'昭阳区',u'鲁甸巧家盐津大关永善绥江镇雄彝良威信水富丽江市',u'市辖区',u'古城区',u'玉龙纳西族自治永胜华坪宁蒗彝族自治普洱市',u'市辖区',u'思茅区',u'宁洱哈尼族彝族自治墨江哈尼族自治景东彝族自治景谷傣族彝族自治镇沅彝族哈尼族拉祜族自治江城哈尼族彝族自治孟连傣族拉祜族佤族自治澜沧拉祜族自治西盟佤族自治临沧市',u'市辖区',u'临翔区',u'凤庆云永德镇康双江拉祜族佤族布朗族傣族自治耿马傣族佤族自治沧源佤族自治楚雄彝族自治州',u'楚雄市',u'双柏牟定南华姚安大姚永仁元谋武定禄丰红河哈尼族彝族自治州',u'个旧市',u'开远市',u'蒙自市',u'弥勒市',u'屏边苗族自治建水石屏泸西元阳红河金平苗族瑶族傣族自治绿春河口瑶族自治文山壮族苗族自治州',u'文山市',u'砚山西畴麻栗坡马关丘北广南富宁西双版纳傣族自治州',u'景洪市',u'勐海勐腊大理白族自治州',u'大理市',u'漾濞彝族自治祥云宾川弥渡南涧彝族自治巍山彝族回族自治永平云龙洱源剑川鹤庆德宏傣族景颇族自治州',u'瑞丽市',u'芒市',u'梁河盈江陇川怒江傈僳族自治州',u'泸水福贡贡山独龙族怒族自治兰坪白族普米族自治迪庆藏族自治州',u'香格里拉德钦维西傈僳族自治西藏自治区',u'拉萨市',u'市辖区',u'城关区',u'林周当雄尼木曲水堆龙德庆达孜墨竹工卡昌都地区',u'昌都江达贡觉类乌齐丁青察雅八宿左贡芒康洛隆边坝山南地区',u'乃东扎囊贡嘎桑日琼结曲松措美洛扎加查隆子错那浪卡子日喀则地区',u'日喀则市',u'南木林江孜定日萨迦拉孜昂仁谢通门白朗仁布康马定结仲巴亚东吉隆聂拉木萨嘎岗巴那曲地区',u'那曲嘉黎比如聂荣安多申扎索班戈巴青尼玛双湖阿里地区',u'普兰札达噶尔日土革吉改则措勤林芝地区',u'林芝工布江达米林墨脱波密察隅朗陕西省',u'西安市',u'市辖区',u'新城区',u'碑林区',u'莲湖区',u'灞桥区',u'未央区',u'雁塔区',u'阎良区',u'临潼区',u'长安区',u'蓝田周至户高陵铜川市',u'市辖区',u'王益区',u'印台区',u'耀州区',u'宜君宝鸡市',u'市辖区',u'渭滨区',u'金台区',u'陈仓区',u'凤翔岐山扶风眉陇千阳麟游凤太白咸阳市',u'市辖区',u'秦都区',u'杨陵区',u'渭城区',u'三原泾阳乾礼泉永寿彬长武旬邑淳化武功兴平市',u'渭南市',u'市辖区',u'临渭区',u'华潼关大荔合阳澄城蒲城白水富平韩城市',u'华阴市',u'延安市',u'市辖区',u'宝塔区',u'延长延川子长安塞志丹吴起甘泉富洛川宜川黄龙黄陵汉中市',u'市辖区',u'汉台区',u'南郑城固洋西乡勉宁强略阳镇巴留坝佛坪榆林市',u'市辖区',u'榆阳区',u'神木府谷横山靖边定边绥德米脂佳吴堡清涧子洲安康市',u'市辖区',u'汉滨区',u'汉阴石泉宁陕紫阳岚皋平利镇坪旬阳白河商洛市',u'市辖区',u'商州区',u'洛南丹凤商南山阳镇安柞水甘肃省',u'兰州市',u'市辖区',u'城关区',u'七里河区',u'西固区',u'安宁区',u'红古区',u'永登皋兰榆中嘉峪关市',u'市辖区',u'金昌市',u'市辖区',u'金川区',u'永昌白银市',u'市辖区',u'白银区',u'平川区',u'靖远会宁景泰天水市',u'市辖区',u'秦州区',u'麦积区',u'清水秦安甘谷武山张家川回族自治武威市',u'市辖区',u'凉州区',u'民勤古浪天祝藏族自治张掖市',u'市辖区',u'甘州区',u'肃南裕固族自治民乐临泽高台山丹平凉市',u'市辖区',u'崆峒区',u'泾川灵台崇信华亭庄浪静宁酒泉市',u'市辖区',u'肃州区',u'金塔瓜州肃北蒙古族自治阿克塞哈萨克族自治玉门市',u'敦煌市',u'庆阳市',u'市辖区',u'西峰区',u'庆城环华池合水正宁宁镇原定西市',u'市辖区',u'安定区',u'通渭陇西渭源临洮漳岷陇南市',u'市辖区',u'武都区',u'成文宕昌康西和礼徽两当临夏回族自治州',u'临夏市',u'临夏康乐永靖广河和政东乡族自治积石山保安族东乡族撒拉族自治甘南藏族自治州',u'合作市',u'临潭卓尼舟曲迭部玛曲碌曲夏河青海省',u'西宁市',u'市辖区',u'城东区',u'城中区',u'城西区',u'城北区',u'大通回族土族自治湟中湟源海东市',u'乐都区',u'平安民和回族土族自治互助土族自治化隆回族自治循化撒拉族自治海北藏族自治州',u'门源回族自治祁连海晏刚察黄南藏族自治州',u'同仁尖扎泽库河南蒙古族自治海南藏族自治州',u'共和同德贵德兴海贵南果洛藏族自治州',u'玛沁班玛甘德达日久治玛多玉树藏族自治州',u'玉树市',u'杂多称多治多囊谦曲麻莱海西蒙古族藏族自治州',u'格尔木市',u'德令哈市',u'乌兰都兰天峻宁夏回族自治区',u'银川市',u'市辖区',u'兴庆区',u'西夏区',u'金凤区',u'永宁贺兰灵武市',u'石嘴山市',u'市辖区',u'大武口区',u'惠农区',u'平罗吴忠市',u'市辖区',u'利通区',u'红寺堡区',u'盐池同心青铜峡市',u'固原市',u'市辖区',u'原州区',u'西吉隆德泾源彭阳中卫市',u'市辖区',u'沙坡头区',u'中宁海原新疆维吾尔自治区',u'乌鲁木齐市',u'市辖区',u'天山区',u'沙依巴克区',u'新市区',u'水磨沟区',u'头屯河区',u'达坂城区',u'米东区',u'乌鲁木齐克拉玛依市',u'市辖区',u'独山子区',u'克拉玛依区',u'白碱滩区',u'乌尔禾区',u'吐鲁番地区',u'吐鲁番市',u'鄯善托克逊哈密地区',u'哈密市',u'巴里坤哈萨克自治伊吾昌吉回族自治州',u'昌吉市',u'阜康市',u'呼图壁玛纳斯奇台吉木萨尔木垒哈萨克自治博尔塔拉蒙古自治州',u'博乐市',u'阿拉山口市',u'精河温泉巴音郭楞蒙古自治州',u'库尔勒市',u'轮台尉犁若羌且末焉耆回族自治和静和硕博湖阿克苏地区',u'阿克苏市',u'温宿库车沙雅新和拜城乌什阿瓦提柯坪克孜勒苏柯尔克孜自治州',u'阿图什市',u'阿克陶阿合奇乌恰喀什地区',u'喀什市',u'疏附疏勒英吉沙泽普莎车叶城麦盖提岳普湖伽师巴楚塔什库尔干塔吉克自治和田地区',u'和田市',u'和田墨玉皮山洛浦策勒于田民丰伊犁哈萨克自治州',u'伊宁市',u'奎屯市',u'伊宁察布查尔锡伯自治霍城巩留新源昭苏特克斯尼勒克塔城地区',u'塔城市',u'乌苏市',u'额敏沙湾托里裕民和布克赛尔蒙古自治阿勒泰地区',u'阿勒泰市',u'布尔津富蕴福海哈巴河青河吉木乃自治区直辖县级行政区划',u'石河子市',u'阿拉尔市',u'图木舒克市',u'五家渠市',u'台湾省',u'香港特别行政区',u'澳门特别行政区']
    return city_list[random.randint(0,city_list.__len__()-1)]

def createMediaChannel():
    media_list=[u'万圣',u'震申',u'易钱庄',u'谦上',u'久久贷',u'红桥',u'丰申',u'云车',u'络慧',u'宇闻',u'去哪贷',u'百度',u'六六鱼',u'360',u'雅其',u'宝蕊',u'元秀',u'客服导入',u'百融',u'测试测渠道']
    return media_list[random.randint(0,media_list.__len__()-1)]


def createLoanW():
    loanW=random.randint(2,15)
    return loanW

def createLoanY():
    loanW=random.randint(2,15)
    return loanW*10000

def createIdcard():
    url = 'http://shenfenzheng.293.net/'
    user_agent = 'Mozilla/4.0 (compatible; MSIE 5.5; Windows NT)'
    headers = {'User-Agent': user_agent}
    try:
        request = urllib2.Request(url, headers=headers)
        response = urllib2.urlopen(request)
        content = response.read().decode('utf-8')
        pattern = re.compile('[0-9]{17}\w{1}')
        items = re.findall(pattern, content)
        item=items[random.randint(0,items.__len__()-1)]
        return str(item)
    except:
        return

def createNowTime():
    tmp1_time = time.localtime(time.time())
    if tmp1_time[5]<10:
        tmp2_time = str(tmp1_time[0]) + str('-') + str(tmp1_time[1]) + str('-') + str(tmp1_time[2]) + ' ' + str(
        tmp1_time[3]) + ':' + str(tmp1_time[4]) + ':0' + str(tmp1_time[5])
    else:
        tmp2_time = str(tmp1_time[0]) + str('-') + str(tmp1_time[1]) + str('-') + str(tmp1_time[2]) + ' ' + str(
            tmp1_time[3]) + ':' + str(tmp1_time[4]) + ':' + str(tmp1_time[5])
    return tmp2_time

def createLiveInTime():
    tmp1_time = time.localtime(time.time())
    tmp2_time = str(tmp1_time[0]-3) + str('/') + str(tmp1_time[1]) + str('/') + str(tmp1_time[2])
    return tmp2_time

def createNextTime():
    tmp1_time = time.localtime(time.time())
    if tmp1_time[3]<23:
        if tmp1_time[5]<10:
            tmp2_time = str(tmp1_time[0]) + str('-') + str(tmp1_time[1]) + str('-') + str(tmp1_time[2]) + ' ' + str(
            tmp1_time[3]+1) + ':' + str(tmp1_time[4]) + ':0' + str(tmp1_time[5])
        else:
            tmp2_time = str(tmp1_time[0]) + str('-') + str(tmp1_time[1]) + str('-') + str(tmp1_time[2]) + ' ' + str(
                tmp1_time[3]+1) + ':' + str(tmp1_time[4]) + ':' + str(tmp1_time[5])
    elif tmp1_time[2]<28:
        if tmp1_time[5]<10:
            tmp2_time = str(tmp1_time[0]) + str('-') + str(tmp1_time[1]) + str('-') + str(tmp1_time[2]+1) + ' ' + str(
            tmp1_time[3]+1) + ':' + str(tmp1_time[4]) + ':0' + str(tmp1_time[5])
        else:
            tmp2_time = str(tmp1_time[0]) + str('-') + str(tmp1_time[1]) + str('-') + str(tmp1_time[2]+1) + ' ' + str(
                tmp1_time[3]+1) + ':' + str(tmp1_time[4]) + ':' + str(tmp1_time[5])
    else:
        if tmp1_time[5]<10:
            tmp2_time = str(tmp1_time[0]+1) + str('-') + str(tmp1_time[1]) + str('-') + str(tmp1_time[2]+1) + ' ' + str(
            tmp1_time[3]+1) + ':' + str(tmp1_time[4]) + ':0' + str(tmp1_time[5])
        else:
            tmp2_time = str(tmp1_time[0]+1) + str('-') + str(tmp1_time[1]) + str('-') + str(tmp1_time[2]+1) + ' ' + str(
                tmp1_time[3]+1) + ':' + str(tmp1_time[4]) + ':' + str(tmp1_time[5])
    return tmp2_time


def createStoreinDoorWebBranch():
    input_host = "*.*.*.*"
    input_port = 2706
    input_user = "flexitm"
    input_passwd = "flexitm"
    input_db = "hbitm_debug"
    conn = pymysql.connect(host=input_host, user=input_user, passwd=input_passwd, db=input_db, port=input_port,charset="utf8")
    cur = conn.cursor()
    sql_num='SELECT count(1) from t_store t where t.isOnceIndoor=1 and t.VALIDFLAG=1;'
    ret=cur.execute(sql_num)
    info = cur.fetchall()
    number= int(info[0][0])
    print number
    sql='SELECT t.STORE_ID,t.CITY_NM,t.CITY_NO,t.P_NM,t.P_NO,t.REGION_NM,t.REGION_NO,t.STORE_ADDR,t.STORE_DESC,t.STORE_NM,t.ZIPCODE,t.MOBILE,t.isOnceIndoor,t.VALIDFLAG from t_store t where t.isOnceIndoor=1 and t.VALIDFLAG=1;'
    ret=cur.execute(sql)
    info = cur.fetchall()
    return info[random.randint(0,number-1)]




def createXlsx(numberOfCust):
    tmp1_time = time.localtime(time.time())
    tmp2_time = str(tmp1_time[0]) + str('-') + str(tmp1_time[1]) + str('-') + str(tmp1_time[2]) + '-' + str(
        tmp1_time[3]) + '-' + str(tmp1_time[4]) + '-' + str(tmp1_time[5])
    array_data = []
    ldata = []
    tittle = [u"客户姓名", u"联系电话", u"客户城市", u"媒体来源"]
    ldata.append(tittle)

    file_save_path = 'C:\Users\Administrator\Desktop\\xlsxs\\' + tmp2_time + '.xlsx'
    workbook = xlsxwriter.Workbook(file_save_path)  # 创建一个excel文件
    for num in range(1, numberOfCust+1):
        array_data.append(createName())
        array_data.append(createPhone())
        array_data.append(createCity())
        array_data.append(createMediaChannel())
        ldata.append(array_data)
        array_data = []

    worksheet = workbook.add_worksheet()  # 创建一个工作表对象
    for i in range(0, ldata.__len__()):
        for j in range(0, ldata[i].__len__()):
            worksheet.write(i, j, ldata[i][j])
    workbook.close()
    return file_save_path

